tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
# Library for manipulating PNG images
brew "libpng"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Parser generator
brew "bison"
# Library for command-line editing
brew "readline"
# X.Org: Core X11 protocol client library
brew "libx11"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Message bus system, providing inter-application communication
brew "dbus"
# Modern, maintained replacement for ls
brew "eza"
# Lightweight scripting language for querying databases
brew "flux"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Multi-platform library for OpenGL applications
brew "glfw"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Linear Algebra PACKage
brew "lapack"
# Pager program similar to more
brew "less"
# Portable Foreign Function Interface library
brew "libffi"
# Implementation of the file(1) command
brew "libmagic"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Manage multiple NodeJS versions
brew "nodenv"
# Optimized BLAS library
brew "openblas"
# Development kit for the Java programming language
brew "openjdk"
# Object-relational database system
brew "postgresql@14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Software environment for statistical computing
brew "r"
# Persistent key-value database, with built-in net interface
brew "redis"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Safe, concurrent, practical language
brew "rust"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application launcher and productivity software
cask "alfred"
# Menu bar icon organiser
cask "bartender"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-mononoki-nerd-font"
# Free and open-source image editor
cask "gimp"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Programming language for technical computing
cask "julia"
# Open-source keystroke visualiser
cask "keycastr"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Online collaborative whiteboard platform
cask "miro"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Environment for statistical computing and graphics
cask "r"
# All-in-one bookmark manager
cask "raindropio"
# Data science software focusing on R and Python
cask "rstudio"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDF Expert", id: 1055273043
mas "Todoist", id: 585829637
mas "WhatsApp (old)", id: 1147396723
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
vscode "andrewberty.noir-theme-bundle"
vscode "be5invis.vscode-custom-css"
vscode "james-yu.latex-workshop"
vscode "julialang.language-julia"
vscode "maltehei.latex-citations"
vscode "mathematic.vscode-latex"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "rdebugger.r-debugger"
vscode "reditorsupport.r"
vscode "yzane.markdown-pdf"
